RunzeJustin/R-CarM3_Salvator_qnx70/R-CarM3/install/usr/include/arm/atsama5d3x.h
/*
 * $QNXLicenseC:
 * Copyright 2013, QNX Software Systems.
 *
 * Licensed under the Apache License, Version 2.0 (the "License"). You
 * may not reproduce, modify or distribute this software except in
 * compliance with the License. You may obtain a copy of the License
 * at: http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" basis,
 * WITHOUT WARRANTIES OF ANY KIND, either express or implied.
 *
 * This file may contain contributions from others, either as
 * contributors under the License or as licensors under other terms.
 * Please review this entire file for other proprietary rights or license
 * notices, as well as the QNX Development Suite License Guide at
 * http://licensing.qnx.com/license-guide/ for other information.
 * $
 */


#ifndef _ATSAMA5D3X_H__
#define _ATSAMA5D3X_H__

/* ************************************************************************** */
/*   PERIPHERAL ID DEFINITIONS FOR SAMA5D3x                                   */
/* ************************************************************************** */

#define SAMA5D3X_ID_FIQ     0    /* Advanced Interrupt Controller (FIQ) */
#define SAMA5D3X_ID_SYS     1    /* System Controller Interrupt (SYS) */
#define SAMA5D3X_ID_DBGU    2    /* Debug Unit Interrupt (DBGU) */
#define SAMA5D3X_ID_PIT     3    /* Periodic Interval Timer Interrupt (PIT) */
#define SAMA5D3X_ID_WDT     4    /* Watchdog timer Interrupt (WDT) */
#define SAMA5D3X_ID_SMC     5    /* Multi-bit ECC Interrupt (SMC) */
#define SAMA5D3X_ID_PIOA    6    /* Parallel I/O Controller A (PIOA) */
#define SAMA5D3X_ID_PIOB    7    /* Parallel I/O Controller B (PIOB) */
#define SAMA5D3X_ID_PIOC    8    /* Parallel I/O Controller C (PIOC) */
#define SAMA5D3X_ID_PIOD    9    /* Parallel I/O Controller D (PIOD) */
#define SAMA5D3X_ID_PIOE   10    /* Parallel I/O Controller E (PIOE) */
#define SAMA5D3X_ID_SMD    11    /* SMD Soft Modem (SMD) */
#define SAMA5D3X_ID_USART0 12    /* USART 0 (USART0) */
#define SAMA5D3X_ID_USART1 13    /* USART 1 (USART1) */
#define SAMA5D3X_ID_USART2 14    /* USART 2 (USART2) */
#define SAMA5D3X_ID_USART3 15    /* USART 3 (USART3) */
#define SAMA5D3X_ID_UART0  16    /* UART 0 (UART0) */
#define SAMA5D3X_ID_UART1  17    /* UART 1 (UART1) */
#define SAMA5D3X_ID_TWI0   18    /* Two-Wire Interface 0 (TWI0) */
#define SAMA5D3X_ID_TWI1   19    /* Two-Wire Interface 1 (TWI1) */
#define SAMA5D3X_ID_TWI2   20    /* Two-Wire Interface 2 (TWI2) */
#define SAMA5D3X_ID_HSMCI0 21    /* High Speed Multimedia Card Interface 0 (HSMCI0) */
#define SAMA5D3X_ID_HSMCI1 22    /* High Speed Multimedia Card Interface 1 (HSMCI1) */
#define SAMA5D3X_ID_HSMCI2 23    /* High Speed Multimedia Card Interface 2 (HSMCI2) */
#define SAMA5D3X_ID_SPI0   24    /* Serial Peripheral Interface 0 (SPI0) */
#define SAMA5D3X_ID_SPI1   25    /* Serial Peripheral Interface 1 (SPI1) */
#define SAMA5D3X_ID_TC0    26    /* Timer Counter 0 (ch. 0, 1, 2) (TC0) */
#define SAMA5D3X_ID_TC1    27    /* Timer Counter 1 (ch. 3, 4, 5) (TC1) */
#define SAMA5D3X_ID_PWM    28    /* Pulse Width Modulation Controller (PWM) */
#define SAMA5D3X_ID_ADC    29    /* Touch Screen ADC Controller (ADC) */
#define SAMA5D3X_ID_DMAC0  30    /* DMA Controller 0 (DMAC0) */
#define SAMA5D3X_ID_DMAC1  31    /* DMA Controller 1 (DMAC1) */
#define SAMA5D3X_ID_UHPHS  32    /* USB Host High Speed (UHPHS) */
#define SAMA5D3X_ID_UDPHS  33    /* USB Device High Speed (UDPHS) */
#define SAMA5D3X_ID_GMAC   34    /* Gigabit Ethernet MAC (GMAC) */
#define SAMA5D3X_ID_EMAC   35    /* Ethernet MAC (EMAC) */
#define SAMA5D3X_ID_LCDC   36    /* LCD Controller (LCDC) */
#define SAMA5D3X_ID_ISI    37    /* Image Sensor Interface (ISI) */
#define SAMA5D3X_ID_SSC0   38    /* Synchronous Serial Controller 0 (SSC0) */
#define SAMA5D3X_ID_SSC1   39    /* Synchronous Serial Controller 1 (SSC1) */
#define SAMA5D3X_ID_CAN0   40    /* CAN controller 0 (CAN0) */
#define SAMA5D3X_ID_CAN1   41    /* CAN controller 1 (CAN1) */
#define SAMA5D3X_ID_SHA    42    /* Secure Hash Algorithm (SHA) */
#define SAMA5D3X_ID_AES    43    /* Advanced Encryption Standard (AES) */
#define SAMA5D3X_ID_TDES   44    /* Triple Data EncryptionStandard (TDES) */
#define SAMA5D3X_ID_TRNG   45    /* True Random Number Generator (TRNG) */
#define SAMA5D3X_ID_ARM    46    /* Performance Monitor Unit (ARM) */
#define SAMA5D3X_ID_IRQ    47    /* Advanced Interrupt Controller (IRQ) */
#define SAMA5D3X_ID_FUSE   48    /* Fuse Controller (FUSE) */
#define SAMA5D3X_ID_MPDDRC 49    /* MPDDR controller (MPDDRC) */

#define SAMA5D3X_ID_PERIPH_COUNT 50    /* Number of peripheral IDs */



/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMA5D3x                                    */
/* ************************************************************************** */

#define SAMA5D3X_NFC_SRAM    0x00200000    /* (NFC_SRAM) Base Address */
#define SAMA5D3X_SMD_BASE    0x00400000    /* (SMD   ) Base Address */
#define SAMA5D3X_AXIMX_BASE  0x00800000    /* (AXIMX ) Base Address */
#define SAMA5D3X_HSMCI0_BASE 0xF0000000    /* (HSMCI0) Base Address */
#define SAMA5D3X_SPI0_BASE   0xF0004000    /* (SPI0  ) Base Address */
#define SAMA5D3X_SSC0_BASE   0xF0008000    /* (SSC0  ) Base Address */
#define SAMA5D3X_CAN0_BASE   0xF000C000    /* (CAN0  ) Base Address */
#define SAMA5D3X_TC0_BASE    0xF0010000    /* (TC0   ) Base Address */
#define SAMA5D3X_TWI0_BASE   0xF0014000    /* (TWI0  ) Base Address */
#define SAMA5D3X_TWI1_BASE   0xF0018000    /* (TWI1  ) Base Address */
#define SAMA5D3X_USART0_BASE 0xF001C000    /* (USART0) Base Address */
#define SAMA5D3X_USART1_BASE 0xF0020000    /* (USART1) Base Address */
#define SAMA5D3X_UART0_BASE  0xF0024000    /* (UART0 ) Base Address */
#define SAMA5D3X_GMAC_BASE   0xF0028000    /* (GMAC  ) Base Address */
#define SAMA5D3X_PWM_BASE    0xF002C000    /* (PWM   ) Base Address */
#define SAMA5D3X_LCDC_BASE   0xF0030000    /* (LCDC  ) Base Address */
#define SAMA5D3X_ISI_BASE    0xF0034000    /* (ISI   ) Base Address */
#define SAMA5D3X_SFR_BASE    0xF0038000    /* (SFR   ) Base Address */
#define SAMA5D3X_HSMCI1_BASE 0xF8000000    /* (HSMCI1) Base Address */
#define SAMA5D3X_HSMCI2_BASE 0xF8004000    /* (HSMCI2) Base Address */
#define SAMA5D3X_SPI1_BASE   0xF8008000    /* (SPI1  ) Base Address */
#define SAMA5D3X_SSC1_BASE   0xF800C000    /* (SSC1  ) Base Address */
#define SAMA5D3X_CAN1_BASE   0xF8010000    /* (CAN1  ) Base Address */
#define SAMA5D3X_TC1_BASE    0xF8014000    /* (TC1   ) Base Address */
#define SAMA5D3X_ADC_BASE    0xF8018000    /* (ADC   ) Base Address */
#define SAMA5D3X_TWI2_BASE   0xF801C000    /* (TWI2  ) Base Address */
#define SAMA5D3X_USART2_BASE 0xF8020000    /* (USART2) Base Address */
#define SAMA5D3X_USART3_BASE 0xF8024000    /* (USART3) Base Address */
#define SAMA5D3X_UART1_BASE  0xF8028000    /* (UART1 ) Base Address */
#define SAMA5D3X_EMAC_BASE   0xF802C000    /* (EMAC  ) Base Address */
#define SAMA5D3X_UDPHS_BASE  0xF8030000    /* (UDPHS ) Base Address */
#define SAMA5D3X_SHA_BASE    0xF8034000    /* (SHA   ) Base Address */
#define SAMA5D3X_AES_BASE    0xF8038000    /* (AES   ) Base Address */
#define SAMA5D3X_TDES_BASE   0xF803C000    /* (TDES  ) Base Address */
#define SAMA5D3X_TRNG_BASE   0xF8040000    /* (TRNG  ) Base Address */
#define SAMA5D3X_SMC_BASE    0xFFFFC000    /* (SMC   ) Base Address */
#define SAMA5D3X_FUSE_BASE   0xFFFFE400    /* (FUSE  ) Base Address */
#define SAMA5D3X_DMAC0_BASE  0xFFFFE600    /* (DMAC0 ) Base Address */
#define SAMA5D3X_DMAC1_BASE  0xFFFFE800    /* (DMAC1 ) Base Address */
#define SAMA5D3X_MPDDRC_BASE 0xFFFFEA00    /* (MPDDRC) Base Address */
#define SAMA5D3X_MATRIX_BASE 0xFFFFEC00    /* (MATRIX) Base Address */
#define SAMA5D3X_DBGU_BASE   0xFFFFEE00    /* (DBGU  ) Base Address */
#define SAMA5D3X_AIC_BASE    0xFFFFF000    /* (AIC   ) Base Address */
#define SAMA5D3X_PIOA_BASE   0xFFFFF200    /* (PIOA  ) Base Address */
#define SAMA5D3X_PIOB_BASE   0xFFFFF400    /* (PIOB  ) Base Address */
#define SAMA5D3X_PIOC_BASE   0xFFFFF600    /* (PIOC  ) Base Address */
#define SAMA5D3X_PIOD_BASE   0xFFFFF800    /* (PIOD  ) Base Address */
#define SAMA5D3X_PIOE_BASE   0xFFFFFA00    /* (PIOE  ) Base Address */
#define SAMA5D3X_PMC_BASE    0xFFFFFC00    /* (PMC   ) Base Address */
#define SAMA5D3X_RSTC_BASE   0xFFFFFE00    /* (RSTC  ) Base Address */
#define SAMA5D3X_SHDWC_BASE  0xFFFFFE10    /* (SHDWC ) Base Address */
#define SAMA5D3X_PIT_BASE    0xFFFFFE30    /* (PIT   ) Base Address */
#define SAMA5D3X_WDT_BASE    0xFFFFFE40    /* (WDT   ) Base Address */
#define SAMA5D3X_SCKC_BASE   0xFFFFFE50    /* (SCKC  ) Base Address */
#define SAMA5D3X_BSC_BASE    0xFFFFFE54    /* (BSC   ) Base Address */
#define SAMA5D3X_GPBR_BASE   0xFFFFFE60    /* (GPBR  ) Base Address */
#define SAMA5D3X_RTC_BASE    0xFFFFFEB0    /* (RTC   ) Base Address */


/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMA5D3x */
/* ************************************************************************** */

#define SAMA5D3X_IRAM0_SIZE 0x10000
#define SAMA5D3X_IRAM1_SIZE 0x10000
#define SAMA5D3X_IROM_SIZE  0x20000
#define SAMA5D3X_IRAM_SIZE  (IRAM0_SIZE+IRAM1_SIZE)

#define SAM5D3X_NFC_SRAM_SIZE 0x2000
#define SAMA5D3X_EBI_MEM_SIZE 0x10000000

#define SAMA5D3X_EBI_CS0_BASE   0x10000000 /**< EBI Chip Select 0 base address */
#define SAMA5D3X_DDR_CS_BASE    0x20000000 /**< DDR Chip Select base address */
#define SAMA5D3X_EBI_CS1_BASE   0x40000000 /**< EBI Chip Select 1 base address */
#define SAMA5D3X_EBI_CS2_BASE   0x50000000 /**< EBI Chip Select 2 base address */
#define SAMA5D3X_EBI_CS3_BASE   0x60000000 /**< EBI Chip Select 3 base address */
#define SAMA5D3X_EBI_NF_BASE    0x60000000 /**< NAND Flash on EBI Chip Select 3 base address */
#define SAMA5D3X_NFC_BASE       0x70000000 /**< NAND Flash Controller Command base address */
#define SAMA5D3X_IROM_BASE      0x00100000 /**< Internal ROM base address */
#define SAMA5D3X_IRAM0_BASE     0x00300000 /**< Internal RAM 0 base address */
#if defined IRAM0_SIZE
#define SAMA5D3X_IRAM1_BASE     (IRAM0_ADDR+IRAM0_SIZE) /**< Internal RAM 1 base address */
#endif
#define SAMA5D3X_UDPHS_RAM_BASE 0x00500000 /**< USB High Speed Device Port RAM base address */
#define SAMA5D3X_UHP_OHCI_BASE  0x00600000 /**< USB Host Port OHCI base address */
#define SAMA5D3X_UHP_EHCI_BASE  0x00700000 /**< USB Host Port EHCI base address */
#define SAMA5D3X_DAP_BASE       0x00900000 /**< Debug Access Port base address */



/* ************************************************************************** */
/*   Peripheral definitions		*/
/* ************************************************************************** */

/* Periodic Interval Timer */
#define SAMA5D3X_PIT_SIZE                    0x10
#define SAMA5D3X_PIT_MR                      0x00
#define SAMA5D3X_PIT_SR                      0x04
#define SAMA5D3X_PIT_PIVR                    0x08
#define SAMA5D3X_PIT_PIIR                    0x0c

/* (DBGU) */
#define SAMA5D3X_DBGU_SIZE                   0x100
#define SAMA5D3X_DBGU_CR                     0x00
#define SAMA5D3X_DBGU_MR                     0x04
#define SAMA5D3X_DBGU_IER                    0x08
#define SAMA5D3X_DBGU_IDR                    0x0c
#define SAMA5D3X_DBGU_IMR                    0x10
#define SAMA5D3X_DBGU_SR                     0x14
#define SAMA5D3X_DBGU_RHR                    0x18
#define SAMA5D3X_DBGU_THR                    0x1c
#define SAMA5D3X_DBGU_BRGR                   0x20
#define SAMA5D3X_DBGU_CIDR                   0x40
#define SAMA5D3X_DBGU_EXID                   0x44
#define SAMA5D3X_DBGU_FNR                    0x48


/* Advanced Interrupt Controller */
#define SAMA5D3X_AIC_SIZE       0x200
#define SAMA5D3X_AIC_SSR		0x00 	// Source Select Register
#define SAMA5D3X_AIC_SMR		0x04	// Source Mode Register
#define SAMA5D3X_AIC_SVR		0x08	// Source Vector Register
#define SAMA5D3X_AIC_IVR		0x10	// Interrupt Vector Register
#define SAMA5D3X_AIC_FVR		0x14	// FIQ Interrupt Vector Register
#define SAMA5D3X_AIC_ISR		0x18	// Interrupt Status Register
#define SAMA5D3X_AIC_IPR0		0x20	// Interrupt Pending Register 0(2)
#define SAMA5D3X_AIC_IPR3		0x2C	// Interrupt Pending Register 3(2)
#define SAMA5D3X_AIC_IMR		0x30	// Interrupt Mask Register
#define SAMA5D3X_AIC_CISR		0x34	// Core Interrupt Status Register
#define SAMA5D3X_AIC_EOICR		0x38	// End of Interrupt Command Register
#define SAMA5D3X_AIC_SPU		0x3C	// Spurious Interrupt Vector Register
#define SAMA5D3X_AIC_IECR		0x40	// Interrupt Enable Command Register
#define SAMA5D3X_AIC_IDCR		0x44	// Interrupt Disable Command Register
#define SAMA5D3X_AIC_ICCR		0x48	// Interrupt Clear Command Register
#define SAMA5D3X_AIC_ISCR		0x4C	// Interrupt Set Command Register
#define SAMA5D3X_AIC_FFER		0x50	// Fast Forcing Enable Register
#define SAMA5D3X_AIC_FFDR		0x54	// Fast Forcing Disable Register
#define SAMA5D3X_AIC_FFSR		0x58	// Fast Forcing Status Register
#define SAMA5D3X_AIC_DCR		0x6C	// Debug Control Register
#define SAMA5D3X_AIC_WPMR		0xE4	// Write Protect Mode Register
#define SAMA5D3X_AIC_WPSR		0xE8	// Write Protect Status Register

