RunzeJustin/R-CarM3_Salvator_qnx70/R-CarM3/install/usr/include/arm/atsama5d3x.h
#define SAMA5D3X_AIC_WP_KEY		0x41494300	// Write Protect key for AIC


/* Power Management Controller */
#define SAMA5D3X_PMC_SCER		0x0000	// System Clock Enable Register
#define SAMA5D3X_PMC_SCDR		0x0004	// System Clock Disable Register
#define SAMA5D3X_PMC_SCSR		0x0008	// System Clock Status Register
#define SAMA5D3X_PMC_PCER0		0x0010	// Peripheral Clock Enable Register 0
#define SAMA5D3X_PMC_PCDR0		0x0014	// Peripheral Clock Disable Register 0
#define SAMA5D3X_PMC_PCSR0		0x0018	// Peripheral Clock Status Register 0
#define SAMA5D3X_CKGR_UCKR		0x001C	// UTMI Clock Register
#define SAMA5D3X_CKGR_MOR		0x0020	// Main Oscillator Register
#define SAMA5D3X_CKGR_MCFR		0x0024	// Main Clock Frequency Register
#define SAMA5D3X_CKGR_PLLAR		0x0028	// PLLA Register
#define SAMA5D3X_PMC_MCKR		0x0030	// Master Clock Register
#define SAMA5D3X_PMC_USB		0x0038	// USB Clock Register
#define SAMA5D3X_PMC_SMD		0x003C	// Soft Modem Clock Register
#define SAMA5D3X_PMC_PCK0		0x0040	// Programmable Clock 0 Register
#define SAMA5D3X_PMC_PCK1		0x0044	// Programmable Clock 1 Register
#define SAMA5D3X_PMC_PCK2		0x0048	// Programmable Clock 2 Register
#define SAMA5D3X_PMC_IER		0x0060	// Interrupt Enable Register
#define SAMA5D3X_PMC_IDR		0x0064	// Interrupt Disable Register
#define SAMA5D3X_PMC_SR			0x0068	// Status Register
#define SAMA5D3X_PMC_IMR		0x006C	// Interrupt Mask Register
#define SAMA5D3X_PMC_FOCR		0x0078	// Fault Output Clear Register
#define SAMA5D3X_PMC_PLLICPR	0x0080	// PLL Charge Pump Current Register
#define SAMA5D3X_PMC_WPMR		0x00E4	// Write Protect Mode Register
#define SAMA5D3X_PMC_WPSR		0x00E8	// Write Protect Status Register
#define SAMA5D3X_PMC_PCER1		0x0100	// Peripheral Clock Enable Register 1
#define SAMA5D3X_PMC_PCDR1		0x0104	// Peripheral Clock Disable Register 1
#define SAMA5D3X_PMC_PCSR1		0x0108	// Peripheral Clock Status Register 1
#define SAMA5D3X_PMC_PCR		0x010C	// Peripheral Control Register
#define SAMA5D3X_PMC_OCR		0x0110	// Oscillator Calibration Register

#define SAMA5D3X_PMC_WP_KEY		0x504D4300	// Write Protect key for PMC


/* -------- PMC_PCR : (PMC Offset: 0x010C) Peripheral Control Register -------- */
#define PMC_PCR_PID_Pos 		0
#define PMC_PCR_PID_Msk 		(0x3F << PMC_PCR_PID_Pos)
#define PMC_PCR_PID(value) 		((PMC_PCR_PID_Msk & ((value) << PMC_PCR_PID_Pos)))
#define PMC_PCR_CMD 			(1 << 12)
#define PMC_PCR_DIV_Pos 		16
#define PMC_PCR_DIV_Msk 		(3 << PMC_PCR_DIV_Pos)
#define   PMC_PCR_DIV_PERIPH_DIV_MCK 	(0 << 16)
#define   PMC_PCR_DIV_PERIPH_DIV2_MCK 	(1 << 16)
#define   PMC_PCR_DIV_PERIPH_DIV4_MCK 	(2 << 16)
#define   PMC_PCR_DIV_PERIPH_DIV8_MCK 	(3 << 16)
#define PMC_PCR_EN 				(1 << 28)

/* USB clock Definitions */
#define PMC_UCKR_PLLCOUNT		(0x3 << 20)	/* PLL count for USB Clock */
#define PMC_UCKR_UPLLEN			(0x1 << 16)	/* UTMI PLL is enabled */
#define PMC_UCKR_BIASEN			(0x1 << 24)	/* UTMI BIAS is enabled */
#define PMC_SR_LOCKU			0x00000040	/* UPLL lock bit */


/* PIO (Pinmux and GPIO controllers) */
#define SAMA5D3X_PIO_PER		0x0000	// PIO Enable Register
#define SAMA5D3X_PIO_PDR		0x0004	// PIO Disable Register
#define SAMA5D3X_PIO_PSR		0x0008	// PIO Status Register
#define SAMA5D3X_PIO_OER		0x0010	// Output Enable Register
#define SAMA5D3X_PIO_ODR		0x0014	// Output Disable Register
#define SAMA5D3X_PIO_OSR		0x0018	// Output Status Register
#define SAMA5D3X_PIO_IFER		0x0020	// Glitch Input Filter Enable Register
#define SAMA5D3X_PIO_IFDR		0x0024	// Glitch Input Filter Disable Register
#define SAMA5D3X_PIO_IFSR		0x0028	// Glitch Input Filter Status Register
#define SAMA5D3X_PIO_SODR		0x0030	// Set Output Data Register
#define SAMA5D3X_PIO_CODR		0x0034	// Clear Output Data Register
#define SAMA5D3X_PIO_ODSR		0x0038	// Output Data Status Register
#define SAMA5D3X_PIO_PDSR		0x003C	// Pin Data Status Register
#define SAMA5D3X_PIO_IER		0x0040	// Interrupt Enable Register
#define SAMA5D3X_PIO_IDR		0x0044	// Interrupt Disable Register
#define SAMA5D3X_PIO_IMR		0x0048	// Interrupt Mask Register
#define SAMA5D3X_PIO_ISR		0x004C	// Interrupt Status Register(4)
#define SAMA5D3X_PIO_MDER		0x0050	// Multi-driver Enable Register
#define SAMA5D3X_PIO_MDDR		0x0054	// Multi-driver Disable Register
#define SAMA5D3X_PIO_MDSR		0x0058	// Multi-driver Status Register
#define SAMA5D3X_PIO_PUDR		0x0060	// Pull-up Disable Register
#define SAMA5D3X_PIO_PUER		0x0064	// Pull-up Enable Register
#define SAMA5D3X_PIO_PUSR		0x0068	// Pad Pull-up Status Register
#define SAMA5D3X_PIO_ABCDSR1	0x0070	// Peripheral Select Register 1
#define SAMA5D3X_PIO_ABCDSR2	0x0074	// Peripheral Select Register 2
#define SAMA5D3X_PIO_IFSCDR		0x0080	// Input Filter Slow Clock Disable Register
#define SAMA5D3X_PIO_IFSCER		0x0084	// Input Filter Slow Clock Enable Register
#define SAMA5D3X_PIO_IFSCSR		0x0088	// Input Filter Slow Clock Status Register
#define SAMA5D3X_PIO_SCDR		0x008C	// Slow Clock Divider Debouncing Register
#define SAMA5D3X_PIO_PPDDR		0x0090	// Pad Pull-down Disable Register
#define SAMA5D3X_PIO_PPDER		0x0094	// Pad Pull-down Enable Register
#define SAMA5D3X_PIO_PPDSR		0x0098	// Pad Pull-down Status Register
#define SAMA5D3X_PIO_OWER		0x00A0	// Output Write Enable
#define SAMA5D3X_PIO_OWDR		0x00A4	// Output Write Disable
#define SAMA5D3X_PIO_OWSR		0x00A8	// Output Write Status Register
#define SAMA5D3X_PIO_AIMER		0x00B0	// Additional Interrupt Modes Enable Register
#define SAMA5D3X_PIO_AIMDR		0x00B4	// Additional Interrupt Modes Disables Register
#define SAMA5D3X_PIO_AIMMR		0x00B8	// Additional Interrupt Modes Mask Register
#define SAMA5D3X_PIO_ESR		0x00C0	// Edge Select Register
#define SAMA5D3X_PIO_LSR		0x00C4	// Level Select Register
#define SAMA5D3X_PIO_ELSR		0x00C8	// Edge/Level Status Register
#define SAMA5D3X_PIO_FELLSR		0x00D0	// Falling Edge/Low Level Select Register
#define SAMA5D3X_PIO_REHLSR		0x00D4	// Rising Edge/ High Level Select Register
#define SAMA5D3X_PIO_FRLHSR		0x00D8	// Fall/Rise - Low/High Status Register
#define SAMA5D3X_PIO_LOCKSR		0x00E0	// Lock Status
#define SAMA5D3X_PIO_WPMR		0x00E4	// Write Protect Mode Register
#define SAMA5D3X_PIO_WPSR		0x00E8	// Write Protect Status Register
#define SAMA5D3X_PIO_SCHMITT	0x0100	// Schmitt Trigger Register
#define SAMA5D3X_PIO_DRIVER1	0x0118	// I/O Drive Register 1
#define SAMA5D3X_PIO_DRIVER2	0x011C	// I/O Drive Register 2
#define SAMA5D3X_PIO_KER		0x0120	// Keypad Controller Enable Register
#define SAMA5D3X_PIO_KRCR		0x0124	// Keypad Controller Row Column Register
#define SAMA5D3X_PIO_KDR		0x0128	// Keypad Controller Debouncing Register
#define SAMA5D3X_PIO_KIER		0x0130	// Keypad Controller Interrupt Enable Register
#define SAMA5D3X_PIO_KIDR		0x0134	// Keypad Controller Interrupt Disable Register
#define SAMA5D3X_PIO_KIMR		0x0138	// Keypad Controller Interrupt Mask Register
#define SAMA5D3X_PIO_KSR		0x013C	// Keypad Controller Status Register
#define SAMA5D3X_PIO_KKPR		0x0140	// Keypad Controller Key Press Register
#define SAMA5D3X_PIO_KKRR		0x0144	// Keypad Controller Key Release Register

