RunzeJustin/R-CarM3_Salvator_qnx70/R-CarM3/install/usr/include/arm/atsama5d3x.h
#define SAMA5D3X_PIO_WP_KEY		0x50494F00	// Write Protect key for PIO

/* TWI (Two Wire Interface controllers) */
#define SAMA5D3X_TWI_SIZE			0x100
#define SAMA5D3X_TWI_WPROT_MODE		0xE4	// Write Protect Mode Register

#define SAMA5D3X_TWI_WP_KEY			0x54574900	// Write Protect key for TWI

/* SFR (Special Function Registers) */
#define SAMA5D3X_SFR_OHCIICR		0x10 	// OHCI Interrupt Configuration Register
#define SAMA5D3X_SFR_OHCIISR		0x14 	// OHCI Interrupt Status Register
#define SAMA5D3X_SFR_AHB			0x20 	// AHB Configuration Register
#define SAMA5D3X_SFR_BRIDGE			0x24 	// Bridge Configuration Register
#define SAMA5D3X_SFR_SECURE			0x28 	// Security Configuration Register
#define SAMA5D3X_SFR_UTMICKTRIM		0x30 	// UTMI Clock Trimming Register
#define SAMA5D3X_SFR_UTMIHSTRIM		0x34 	// UTMI High Speed Trimming Register
#define SAMA5D3X_SFR_UTMIFSTRIM		0x38 	// UTMI Full Speed Trimming Register
#define SAMA5D3X_SFR_UTMISWAP		0x3C 	// UTMI DP/DM Pin Swapping Register
#define SAMA5D3X_SFR_EBICFG			0x40 	// EBI Configuration Register


/* USART */
#define SAMA5D3X_USART_SIZE			0x100

/* CAN */
#define SAMA5D3X_CAN_SIZE			0x400

/* RTC */
#define SAMA5D3X_RTC_SIZE			0x100
#define SAMA5D3X_RTC_TIME			0x08
#define SAMA5D3X_RTC_CAL			0x0C

/* RSTC (Reset Controller) */
#define SAMA5D3X_RSTC_SIZE			0x10
#define SAMA5D3X_RSTC_CR			0x00
#define SAMA5D3X_RSTC_SR			0x04
#define SAMA5D3X_RSTC_MR			0x08

/* Shutdown Controller */
#define SAMA5D3X_SHDWC_SIZE			0x0c
#define SAMA5D3X_SHDWC_CR			0x00
#define SAMA5D3X_SHDWC_MR			0x04
#define SAMA5D3X_SHDWC_SR			0x08

/* DMAC (DMA Controller) */
#define DMAC_GCFG			0x000	// DMAC Global Configuration Register
#define DMAC_EN				0x004	// DMAC Enable Register
#define DMAC_SREQ			0x008	// DMAC Software Single Request Register
#define DMAC_CREQ			0x00C	// DMAC Software Chunk Transfer Request Register
#define DMAC_LAST			0x010	// DMAC Software Last Transfer Flag Register
#define DMAC_EBCIER			0x018	// DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Enable register.
#define DMAC_EBCIDR			0x01C	// DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Disable register.
#define DMAC_EBCIMR			0x020	// DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Mask Register.
#define DMAC_EBCISR			0x024	// DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Status Register.
#define DMAC_CHER			0x028	// DMAC Channel Handler Enable Register
#define DMAC_CHDR			0x02C	// DMAC Channel Handler Disable Register
#define DMAC_CHSR			0x030	// DMAC Channel Handler Status Register
#define DMAC_SADDR(ch_num)	(0x03C+(ch_num)*(0x28)+(0x0))	// DMAC Channel Source Address Register
#define DMAC_DADDR(ch_num)	(0x03C+(ch_num)*(0x28)+(0x4))	// DMAC Channel Destination Address Register
#define DMAC_DSCR(ch_num)	(0x03C+(ch_num)*(0x28)+(0x8))	// DMAC Channel Descriptor Address Register
#define DMAC_CTRLA(ch_num)	(0x03C+(ch_num)*(0x28)+(0xC))	// DMAC Channel Control A Register
#define DMAC_CTRLB(ch_num)	(0x03C+(ch_num)*(0x28)+(0x10))	// DMAC Channel Control B Register
#define DMAC_CFG(ch_num)	(0x03C+(ch_num)*(0x28)+(0x14))	// DMAC Channel Configuration Register
#define DMAC_SPIP(ch_num)	(0x03C+(ch_num)*(0x28)+(0x18))	// DMAC Channel Source Picture-in-Picture Configuration Register
#define DMAC_DPIP(ch_num)	(0x03C+(ch_num)*(0x28)+(0x1C))	// DMAC Channel Destination Picture-in-Picture Configuration Register
#define DMAC_WPMR			0x1E4	// DMAC Write Protect Mode Register
#define DMAC_WPSR			0x1E8	// DMAC Write Protect Status Register

#define DMAC_WP_KEY		0x444D4100		// Write protect control key



/* LCDC (Display Controller) */
#define SAMA5D3X_LCDC_SIZE		0x2000

#define LCDC_LCDCFG0	0x0000		// LCD Controller Configuration Register 0
#define LCDC_LCDCFG1	0x0004		// LCD Controller Configuration Register 1
#define LCDC_LCDCFG2	0x0008		// LCD Controller Configuration Register 2
#define LCDC_LCDCFG3	0x000C		// LCD Controller Configuration Register 3
#define LCDC_LCDCFG4	0x0010		// LCD Controller Configuration Register 4
#define LCDC_LCDCFG5	0x0014		// LCD Controller Configuration Register 5
#define LCDC_LCDCFG6	0x0018		// LCD Controller Configuration Register 6
#define LCDC_LCDEN		0x0020		// LCD Controller Enable Register
#define LCDC_LCDDIS		0x0024		// LCD Controller Disable Register
#define LCDC_LCDSR		0x0028		// LCD Controller Status Register
#define LCDC_LCDIER		0x002C		// LCD Controller Interrupt Enable Register
#define LCDC_LCDIDR		0x0030		// LCD Controller Interrupt Disable Register
#define LCDC_LCDIMR		0x0034		// LCD Controller Interrupt Mask Register
#define LCDC_LCDISR		0x0038		// LCD Controller Interrupt Status Register
#define LCDC_BASECHER	0x0040		// Base Layer Channel Enable Register
#define LCDC_BASECHDR	0x0044		// Base Layer Channel Disable Register
#define LCDC_BASECHSR	0x0048		// Base Layer Channel Status Register
#define LCDC_BASEIER	0x004C		// Base Layer Interrupt Enable Register
#define LCDC_BASEIDR	0x0050		// Base Layer Interrupt Disabled Register
#define LCDC_BASEIMR	0x0054		// Base Layer Interrupt Mask Register
#define LCDC_BASEISR	0x0058		// Base Layer Interrupt status Register
#define LCDC_BASEHEAD	0x005C		// Base DMA Head Register
#define LCDC_BASEADDR	0x0060		// Base DMA Address Register
#define LCDC_BASECTRL	0x0064		// Base DMA Control Register
#define LCDC_BASENEXT	0x0068		// Base DMA Next Register
#define LCDC_BASECFG0	0x006C		// Base Configuration register 0
#define LCDC_BASECFG1	0x0070		// Base Configuration register 1
#define LCDC_BASECFG2	0x0074		// Base Configuration register 2
#define LCDC_BASECFG3	0x0078		// Base Configuration register 3
#define LCDC_BASECFG4	0x007C		// Base Configuration register 4
#define LCDC_BASECFG5	0x0080		// Base Configuration register 5
#define LCDC_BASECFG6	0x0084		// Base Configuration register 6
#define LCDC_OVR1CHER	0x0140		// Overlay 1 Channel Enable Register
#define LCDC_OVR1CHDR	0x0144		// Overlay 1 Channel Disable Register
#define LCDC_OVR1CHSR	0x0148		// Overlay 1 Channel Status Register
#define LCDC_OVR1IER	0x014C		// Overlay 1 Interrupt Enable Register
#define LCDC_OVR1IDR	0x0150		// Overlay 1 Interrupt Disable Register
#define LCDC_OVR1IMR	0x0154		// Overlay 1 Interrupt Mask Register
#define LCDC_OVR1ISR	0x0158		// Overlay 1 Interrupt Status Register
#define LCDC_OVR1HEAD	0x015C		// Overlay 1 DMA Head Register
#define LCDC_OVR1ADDR	0x0160		// Overlay 1 DMA Address Register
#define LCDC_OVR1CTRL	0x0164		// Overlay1 DMA Control Register
#define LCDC_OVR1NEXT	0x0168		// Overlay1 DMA Next Register
#define LCDC_OVR1CFG0	0x016C		// Overlay 1 Configuration 0 Register
#define LCDC_OVR1CFG1	0x0170		// Overlay 1 Configuration 1 Register
#define LCDC_OVR1CFG2	0x0174		// Overlay 1 Configuration 2 Register
#define LCDC_OVR1CFG3	0x0178		// Overlay 1 Configuration 3 Register
#define LCDC_OVR1CFG4	0x017C		// Overlay 1 Configuration 4 Register
#define LCDC_OVR1CFG5	0x0180		// Overlay 1 Configuration 5 Register
#define LCDC_OVR1CFG6	0x0184		// Overlay 1 Configuration 6 Register
#define LCDC_OVR1CFG7	0x0188		// Overlay 1 Configuration 7 Register
#define LCDC_OVR1CFG8	0x018C		// Overlay 1 Configuration 8Register
#define LCDC_OVR1CFG9	0x0190		// Overlay 1 Configuration 9 Register
#define LCDC_OVR2CHER	0x0240		// Overlay 2 Channel Enable Register
#define LCDC_OVR2CHDR	0x0244		// Overlay 2 Channel Disable Register
#define LCDC_OVR2CHSR	0x0248		// Overlay 2 Channel Status Register
#define LCDC_OVR2IER	0x024C		// Overlay 2 Interrupt Enable Register
#define LCDC_OVR2IDR	0x0250		// Overlay 2 Interrupt Disable Register
#define LCDC_OVR2IMR	0x0254		// Overlay 2 Interrupt Mask Register
#define LCDC_OVR2ISR	0x0258		// Overlay 2 Interrupt status Register
#define LCDC_OVR2HEAD	0x025C		// Overlay 2 DMA Head Register
#define LCDC_OVR2ADDR	0x0260		// Overlay 2 DMA Address Register
#define LCDC_OVR2CTRL	0x0264		// Overlay 2 DMA Control Register
#define LCDC_OVR2NEXT	0x0268		// Overlay 2 DMA Next Register
#define LCDC_OVR2CFG0	0x026C		// Overlay 2 Configuration 0 Register
#define LCDC_OVR2CFG1	0x0270		// Overlay 2 Configuration 1 Register
#define LCDC_OVR2CFG2	0x0274		// Overlay 2 Configuration 2 Register
#define LCDC_OVR2CFG3	0x0278		// Overlay 2 Configuration 3 Register
#define LCDC_OVR2CFG4	0x027C		// Overlay 2 Configuration 4 Register
#define LCDC_OVR2CFG5	0x0280		// Overlay 2 Configuration 5 Register
#define LCDC_OVR2CFG6	0x0284		// Overlay 2 Configuration 6 Register
#define LCDC_OVR2CFG7	0x0288		// Overlay 2 Configuration 7 Register
#define LCDC_OVR2CFG8	0x028C		// Overlay 2 Configuration 8 Register
#define LCDC_OVR2CFG9	0x0290		// Overlay 2 Configuration 9 Register
#define LCDC_HEOCHER	0x0340		// High-End Overlay Channel Enable Register
#define LCDC_HEOCHDR	0x0344		// High-End Overlay Channel Disable Register
#define LCDC_HEOCHSR	0x0348		// High-End Overlay Channel Status Register
#define LCDC_HEOIER		0x034C		// High-End Overlay Interrupt Enable Register
#define LCDC_HEOIDR		0x0350		// High-End Overlay Interrupt Disable Register
#define LCDC_HEOIMR		0x0354		// High-End Overlay Interrupt Mask Register
#define LCDC_HEOISR		0x0358		// High-End Overlay Interrupt Status Register
#define LCDC_HEOHEAD	0x035C		// High-End Overlay DMA Head Register
#define LCDC_HEOADDR	0x0360		// High-End Overlay DMA Address Register
#define LCDC_HEOCTRL	0x0364		// High-End Overlay DMA Control Register
#define LCDC_HEONEXT	0x0368		// High-End Overlay DMA Next Register
#define LCDC_HEOUHEAD	0x036C		// High-End Overlay U DMA Head Register
#define LCDC_HEOUADDR	0x0370		// High-End Overlay U DMA Address Register
#define LCDC_HEOUCTRL	0x0374		// High-End Overlay U DMA control Register
#define LCDC_HEOUNEXT	0x0378		// High-End Overlay U DMA Next Register
#define LCDC_HEOVHEAD	0x037C		// High-End Overlay V DMA Head Register
#define LCDC_HEOVADDR	0x0380		// High-End Overlay V DMA Address Register
#define LCDC_HEOVCTRL	0x0384		// High-End Overlay V DMA control Register
#define LCDC_HEOVNEXT	0x0388		// High-End Overlay VDMA Next Register
#define LCDC_HEOCFG0	0x038C		// High-End Overlay Configuration Register 0
#define LCDC_HEOCFG1	0x0390		// High-End Overlay Configuration Register 1
#define LCDC_HEOCFG2	0x0394		// High-End Overlay Configuration Register 2
#define LCDC_HEOCFG3	0x0398		// High-End Overlay Configuration Register 3
#define LCDC_HEOCFG4	0x039C		// High-End Overlay Configuration Register 4
#define LCDC_HEOCFG5	0x03A0		// High-End Overlay Configuration Register 5
#define LCDC_HEOCFG6	0x03A4		// High-End Overlay Configuration Register 6
#define LCDC_HEOCFG7	0x03A8		// High-End Overlay Configuration Register 7
#define LCDC_HEOCFG8	0x03AC		// High-End Overlay Configuration Register 8
#define LCDC_HEOCFG9	0x03B0		// High-End Overlay Configuration Register 9
#define LCDC_HEOCFG10	0x03B4		// High-End Overlay Configuration Register 10
#define LCDC_HEOCFG11	0x03B8		// High-End Overlay Configuration Register 11
#define LCDC_HEOCFG12	0x03BC		// High-End Overlay Configuration Register 12
#define LCDC_HEOCFG13	0x03C0		// High-End Overlay Configuration Register 13
#define LCDC_HEOCFG14	0x03C4		// High-End Overlay Configuration Register 14
#define LCDC_HEOCFG15	0x03C8		// High-End Overlay Configuration Register 15
#define LCDC_HEOCFG16	0x03CC		// High-End Overlay Configuration Register 16
#define LCDC_HEOCFG17	0x03D0		// High-End Overlay Configuration Register 17
#define LCDC_HEOCFG18	0x03D4		// High-End Overlay Configuration Register 18
#define LCDC_HEOCFG19	0x03D8		// High-End Overlay Configuration Register 19
#define LCDC_HEOCFG20	0x03DC		// High-End Overlay Configuration Register 20
#define LCDC_HEOCFG21	0x03E0		// High-End Overlay Configuration Register 21
#define LCDC_HEOCFG22	0x03E4		// High-End Overlay Configuration Register 22
#define LCDC_HEOCFG23	0x03E8		// High-End Overlay Configuration Register 23
#define LCDC_HEOCFG24	0x03EC		// High-End Overlay Configuration Register 24
#define LCDC_HEOCFG25	0x03F0		// High-End Overlay Configuration Register 25
#define LCDC_HEOCFG26	0x03F4		// High-End Overlay Configuration Register 26
#define LCDC_HEOCFG27	0x03F8		// High-End Overlay Configuration Register 27
#define LCDC_HEOCFG28	0x03FC		// High-End Overlay Configuration Register 28
#define LCDC_HEOCFG29	0x0400		// High-End Overlay Configuration Register 29
#define LCDC_HEOCFG30	0x0404		// High-End Overlay Configuration Register 30
#define LCDC_HEOCFG31	0x0408		// High-End Overlay Configuration Register 31
#define LCDC_HEOCFG32	0x040C		// High-End Overlay Configuration Register 32
#define LCDC_HEOCFG33	0x0410		// High-End Overlay Configuration Register 33
#define LCDC_HEOCFG34	0x0414		// High-End Overlay Configuration Register 34
#define LCDC_HEOCFG35	0x0418		// High-End Overlay Configuration Register 35
#define LCDC_HEOCFG36	0x041C		// High-End Overlay Configuration Register 36
#define LCDC_HEOCFG37	0x0420		// High-End Overlay Configuration Register 37
#define LCDC_HEOCFG38	0x0424		// High-End Overlay Configuration Register 38
#define LCDC_HEOCFG39	0x0428		// High-End Overlay Configuration Register 39
#define LCDC_HEOCFG40	0x042C		// High-End Overlay Configuration Register 40
#define LCDC_HEOCFG41	0x0430		// High-End Overlay Configuration Register 41
#define LCDC_HCRCHER	0x0440		// Hardware Cursor Channel Enable Register
#define LCDC_HCRCHDR	0x0444		// Hardware Cursor Channel disable Register
#define LCDC_HCRCHSR	0x0448		// Hardware Cursor Channel Status Register
#define LCDC_HCRIER		0x044C		// Hardware Cursor Interrupt Enable Register
#define LCDC_HCRIDR		0x0450		// Hardware Cursor Interrupt Disable Register
#define LCDC_HCRIMR		0x0454		// Hardware Cursor Interrupt Mask Register
#define LCDC_HCRISR		0x0458		// Hardware Cursor Interrupt Status Register
#define LCDC_HCRHEAD	0x045C		// Hardware Cursor DMA Head Register
#define LCDC_HCRADDR	0x0460		// Hardware cursor DMA Address Register
#define LCDC_HCRCTRL	0x0464		// Hardware Cursor DMA Control Register
#define LCDC_HCRNEXT	0x0468		// Hardware Cursor DMA NExt Register
#define LCDC_HCRCFG0	0x046C		// Hardware Cursor Configuration 0 Register
#define LCDC_HCRCFG1	0x0470		// Hardware Cursor Configuration 1 Register
#define LCDC_HCRCFG2	0x0474		// Hardware Cursor Configuration 2 Register
#define LCDC_HCRCFG3	0x0478		// Hardware Cursor Configuration 3 Register
#define LCDC_HCRCFG4	0x047C		// Hardware Cursor Configuration 4 Register
#define LCDC_HCRCFG6	0x0484		// Hardware Cursor Configuration 6 Register
#define LCDC_HCRCFG7	0x0488		// Hardware Cursor Configuration 7 Register
#define LCDC_HCRCFG8	0x048C		// Hardware Cursor Configuration 8 Register
#define LCDC_HCRCFG9	0x0490		// Hardware Cursor Configuration 9 Register
#define LCDC_PPCHER		0x0540		// Post Processing Channel Enable Register
#define LCDC_PPCHDR		0x0544		// Post Processing Channel Disable Register
#define LCDC_PPCHSR		0x0548		// Post Processing Channel Status Register
#define LCDC_PPIER		0x054C		// Post Processing Interrupt Enable Register
#define LCDC_PPIDR		0x0550		// Post Processing Interrupt Disable Register
#define LCDC_PPIMR		0x0554		// Post Processing Interrupt Mask Register
#define LCDC_PPISR		0x0558		// Post Processing Interrupt Status Register
#define LCDC_PPHEAD		0x055C		// Post Processing Head Register
#define LCDC_PPADDR		0x0560		// Post Processing Address Register
#define LCDC_PPCTRL		0x0564		// Post Processing Control Register
#define LCDC_PPNEXT		0x0568		// Post Processing Next Register
#define LCDC_PPCFG0		0x056C		// Post Processing Configuration Register 0
#define LCDC_PPCFG1		0x0570		// Post Processing Configuration Register 1
#define LCDC_PPCFG2		0x0574		// Post Processing Configuration Register 2
#define LCDC_PPCFG3		0x0578		// Post Processing Configuration Register 3
#define LCDC_PPCFG4		0x057C		// Post Processing Configuration Register 4
#define LCDC_PPCFG5		0x0580		// Post Processing Configuration Register 5

// Start of each register set
#define LCDC_LAYER_BASE			LCDC_BASECHER
#define LCDC_LAYER_OVERLAY1		LCDC_OVR1CHER
#define LCDC_LAYER_OVERLAY2		LCDC_OVR2CHER
#define LCDC_LAYER_HIGHPERF		LCDC_HEOCHER
#define LCDC_LAYER_CURSOR		LCDC_HCRCHER
#define LCDC_LAYER_POSTPROC		LCDC_PPCHER

