RunzeJustin/R-CarM3_Salvator_qnx70/R-CarM3/install/usr/include/arm/atsama5d3x.h
// Common layers at the start of each layer block
#define LCDC_LAYER_CHER	0x00		// Channel Enable Register
#define LCDC_LAYER_CHDR	0x04		// Channel Disable Register
#define LCDC_LAYER_CHSR	0x08		// Channel Status Register
#define LCDC_LAYER_IER	0x0C		// Interrupt Enable Register
#define LCDC_LAYER_IDR	0x10		// Interrupt Disabled Register
#define LCDC_LAYER_IMR	0x14		// Interrupt Mask Register
#define LCDC_LAYER_ISR	0x18		// Interrupt status Register
#define LCDC_LAYER_HEAD	0x1C		// DMA Head Register
#define LCDC_LAYER_ADDR	0x20		// DMA Address Register
#define LCDC_LAYER_CTRL	0x24		// DMA Control Register
#define LCDC_LAYER_NEXT	0x28		// DMA Next Register

// Overlay 1 and Overlay 2 share the same register layout
#define LCDC_OVRCFG0	0x2C		// Overlay 1 Configuration 0 Register
#define LCDC_OVRCFG1	0x30		// Overlay 1 Configuration 1 Register
#define LCDC_OVRCFG2	0x34		// Overlay 1 Configuration 2 Register
#define LCDC_OVRCFG3	0x38		// Overlay 1 Configuration 3 Register
#define LCDC_OVRCFG4	0x3C		// Overlay 1 Configuration 4 Register
#define LCDC_OVRCFG5	0x40		// Overlay 1 Configuration 5 Register
#define LCDC_OVRCFG6	0x44		// Overlay 1 Configuration 6 Register
#define LCDC_OVRCFG7	0x48		// Overlay 1 Configuration 7 Register
#define LCDC_OVRCFG8	0x4C		// Overlay 1 Configuration 8 Register
#define LCDC_OVRCFG9	0x50		// Overlay 1 Configuration 9 Register

/*
 * SMC controller (NAND etc)
 */
#define SAMA5D3X_SMC_SIZE 0x700
#define SRAM0_SIZE 1200
#define SMC_CFG		0x00
	#define PS512	(0 << 0)
	#define PS1024	(1 << 0)
	#define PS2048	(2 << 0)
	#define PS4096	(3 << 0)
	#define PS8192	(4 << 0)
	#define WSPARE_ON	(1<<8)
	#define WSPARE_OFF	(0<<8)
	#define RSPARE_ON	(1<<9)
	#define RSPARE_OFF	(0<<9)
	#define EDGE_RISE	(0<<12)
	#define EDGE_FALL	(1<<12)
	#define RBEDGE_LEVEL (0<<13)
	#define RBEDGE_TRANS (1<<13)
	#define DTOCYC(n) (((n)&0xf)<<16)

	#define DTOMUL(n) (((n)&0x7)<<20)
		#define X1 0
		#define X16 1
		#define X128 2
		#define X256 3
		#define X1024 4
		#define X4096 5
		#define X65536 6
		#define X1048576 7
	#define CFC_SPARE_SIZE(n) (((((n)/4)-1)&0x7f)<<24)

#define SMC_CTRL	0x04
	#define NAND_ENABLE 0x1
	#define NAND_DISABLE 0x2

#define SMC_SR		0x08
	/* Masks to use on status and interrupt registers */
	#define SMCSTS	(1<<0)
	#define RB_RISE (1<<4)
	#define RB_FALL (1<<5)
	#define NFCBUSY (1<<8)
	#define NFCWR_ST (1<<11)
	#define NFCSID (7<<12)
	#define SMC_XFRDONE (1<<16)
	#define CMDDONE (1<<17)
	#define SMC_DTOE (1<<20)
	#define UNDEF (1<<21)
	#define AWB (1<<22)
	#define NFCASE (1<<23)
	#define RB_EDGE0 (1<<24)
	#define INVALID_BIT (1<<31) /* not defined in docs. Used by software */
	#define SMC_ERRORS (NFCASE | AWB | UNDEF | SMC_DTOE)

#define SMC_IER		0x0C
#define SMC_IDR		0x10
#define SMC_IMR		0x14
#define SMC_ADDR	0x18
#define SMC_BANK	0x1c
// reserved 0x020-0x06c
#define SMC_PME_CCFG	0x70
	#define BCH_ERR2 (0)
	#define BCH_ERR4 (1)
	#define BCH_ERR8 (2)
	#define BCH_ERR12 (3)
	#define BCH_ERR24 (4)
	#define SECTOR_512 ((0) << 4)
	#define SECTOR_1024 ((1) << 4)
	#define PAGESIZE_1SEC ((0) << 8)
	#define PAGESIZE_2SEC ((1) << 8)
	#define PAGESIZE_4SEC ((2) << 8)
	#define PAGESIZE_8SEC ((3) << 8)
	#define ECC_NAND_RD ((0) << 12)
	#define ECC_NAND_WR ((1) << 12)
	#define SPARE_PROTECTED ((1) << 16)
	#define SPARE_NOT_PROTECTED ((0) << 16)
	#define AUTO_ENABLE ((1) << 20)
#define SMC_PMECCSAREA	0x74
#define SMC_PMECCSADDR	0x78
#define SMC_PMECCEADDR	0x7C
// 0x80 Reserved
#define SMC_PMECCTRL	0x84
	#define ECC_RESET (1<<0)
	#define ECC_DATA (1<<1)
	#define ECC_USER (1<<2)
	#define ECC_ENABLE (1<<4)
	#define ECC_DISABLE (1<<5)
#define SMC_PMECCSR		0x88
	#define ECC_BUSY (1)
#define SMC_PMECCIER	0x8C
#define SMC_PMECCIDR	0x90
#define SMC_PMECCIMR	0x94
#define SMC_PMECCISR	0x98
// reserved 0x9C-0xAC
// Redundnacy registers: SEC = 0-?, N=0-10
#define SMC_PMECC_RED(SEC,N) (0x0B0 +((SEC)*0x40)+((N)*4))
// Redundnacy registers: SEC = 0-?, N=0-11
#define SMC_PMECC_REM(SEC,N)	(0x2B0 +((SEC)*0x40)+((N)*4))
// reserved 0x4a0-0x4fc
#define SMC_ELCFG	0x500
#define SMC_ELPRIM	0x504
#define SMC_ELEN	0x508
#define SMC_ELDIS	0x50C
#define SMC_ELSR	0x510
#define SMC_ELIER	0x514
#define SMC_ELIDR	0x518
#define SMC_ELIMR	0x51C
#define SMC_ELISR	0x520
// reserved 0x524 - 0x52c
// SIGMA registers 0-24
#define SMC_SIGMA(N) (0x528 +(N)*4)
// Error location 0-24
#define SMC_ERROR(N) (0x58C +(N)*4)
// reserved 0x5ec - 0x5fc
// Setup Chip Select = 0-3
#define SMC_SETUP(CS)	(0x600 + ((CS)*0x14))
#define SMC_PULSE(CS)	(0x604 + ((CS)*0x14))
#define SMC_CYCLE(CS)	(0x608 + ((CS)*0x14))
#define SMC_TIMINGS(CS)	(0x60C + ((CS)*0x14))
#define SMC_MODE(CS)	(0x610 + ((CS)*0x14))
#define SMC_OCMS		0x6A0
#define SMC_KEY1		0x6A4
#define SMC_KEY2		0x6A8
// reserved 0x6ac - 0x6e0
#define SMC_WPCR		0x6E4
	#define SMC_UNLOCK 0x534D4300
	#define SMC_LOCK 0x534D4301

#define SMC_WPSR		0x6E8

/* For creating NAND Command parameters */
#define NAND_CMD1(n) (((n)&0xff)<<2)
#define NAND_CMD2(n) (((n)&0xff)<<10)
#define NAND_VCMD2 (1<<18)
#define NAND_ACYCLE(n) (((n)&0x7)<<19)
#define NAND_CSID(n) (((n)&0x7)<<22)
#define NAND_DATAEN (1<<25)
#define NAND_NO_DATA (0<<25)
#define NAND_NFCRD (0<<26)
#define NAND_NFCWR (1<<26)
#define NAND_NFC_BUSY (1<<27)

/*
 * CAN Controller register offsets
 */
#define CAN_MR 0x00
	#define CAN_MR_CANEN (1<<0)
	#define CAN_MR_LPB (1<<1)
	#define CAN_MR_ABM (1<<2)
	#define CAN_MR_OVL (1<<3)
	#define CAN_MR_TEOF (1<<4)
	#define CAN_MR_TTM (1<<5)
	#define CAN_MR_TIMFRZ (1<<6)
	#define CAN_MR_DRPT (1<<7)
#define CAN_IER 0x04
#define CAN_IDR 0x08
#define CAN_IMR 0x0C
	#define CAN_IR_ERRA (1<<16)
	#define CAN_IR_WARN (1<<17)
	#define CAN_IR_ERRP (1<<18)
	#define CAN_IR_BOFF (1<<19)
	#define CAN_IR_SLEEP (1<<20)
	#define CAN_IR_WAKEUP (1<<21)
	#define CAN_IR_TOVF (1<<22)
	#define CAN_IR_TSTP (1<<23)
	#define CAN_IR_CERR (1<<24)
	#define CAN_IR_SERR (1<<25)
	#define CAN_IR_AERR (1<<26)
	#define CAN_IR_FERR (1<<27)
	#define CAN_IR_BERR (1<<28)
	#define CAN_ERROR_INTERRUPTS (CAN_IR_CERR | CAN_IR_SERR | CAN_IR_BERR | CAN_IR_FERR | CAN_IR_AERR)
	#define CAN_INFO_INTERRUPTS (CAN_IR_ERRA | CAN_IR_WARN | CAN_IR_ERRP | CAN_IR_BOFF)
#define CAN_SR 0x10
	#define CAN_SR_ERRA (1<<16)
	#define CAN_SR_WARN (1<<17)
	#define CAN_SR_ERRP (1<<18)
	#define CAN_SR_BOFF (1<<19)
	#define CAN_SR_SLEEP (1<<20)
	#define CAN_SR_WAKEUP (1<<21)
	#define CAN_SR_TOVF (1<<22)
	#define CAN_SR_TSTP (1<<23)
	#define CAN_SR_CERR (1<<24)
	#define CAN_SR_SERR (1<<25)
	#define CAN_SR_AERR (1<<26)
	#define CAN_SR_FERR (1<<27)
	#define CAN_SR_BERR (1<<28)
	#define CAN_SR_RBSY (1<<29)
	#define CAN_SR_TBSY (1<<30)
	#define CAN_SR_OVLSY (1<<31)
	#define CAN_BUSY (CAN_SR_OVLSY | CAN_SR_TBSY | CAN_SR_RBSY)
#define CAN_BR 0x14
#define CAN_TIM 0x18
#define CAN_TIMESTP 0x1C
#define CAN_ECR 0x20
#define CAN_TCR 0x24
#define CAN_ACR 0x28
#define CAN_WPMR 0xE4
	#define CAN_DISABLE_WP 0x43414E00
	#define CAN_ENSABLE_WP 0x43414E01
#define CAN_WPSR 0xE8
/* Message mode registers */
#define CAN_MMR(x) (0x200 + ((x)*0x20))
	#define CAN_DIS 0
	#define CAN_RX	1
	#define CAN_RX_OVR	2
	#define CAN_TX	3
	#define CAN_CONS	4
	#define CAN_PROD	5
	#define CAN_MB_TYPE_SHIFT 24
	#define CAN_MB_TYPE_MASK 0x7
	#define CAN_MOT(x) (((x) & CAN_MB_TYPE_MASK) << CAN_MB_TYPE_SHIFT)
	#define CAN_PRIOR(x) (((x) & 0xf)<<16)

/* Message Acceptance Mask registers */
#define CAN_MAM(x) (0x204 + ((x)*0x20))
	#define CAN_ID_A (0<<29)
	#define CAN_ID_B (1<<29)
	#define CAN_MASK_A (0x3ff << 18)
	#define CAN_MASK_B (0x1fffffff)
/* Message ID registers */
#define CAN_MID(x) (0x208 + ((x)*0x20))
	#define CAN_A_ID(x) ((x)<<18)
	#define CAN_B_ID(x) (x)
/* Message Family ID registers */
#define CAN_MFID(x) (0x20C + ((x)*0x20))
/* Message Status register */
#define CAN_MSR(x) (0x210 + ((x)*0x20))
	#define CAN_MSR_MRDY (1<<23)
/* Message Data Low register */
#define CAN_MDL(x) (0x214 + ((x)*0x20))
/* Message Data High register */
#define CAN_MDH(x) (0x218 + ((x)*0x20))
/* Message Control register */
#define CAN_MCR(x) (0x21C + ((x)*0x20))
	#define CAN_MCR_MDLC(x) (((x)&0xf)<<16)
	#define CAN_MCR_MRTR (1<<20)
	#define CAN_MCR_MACR (1<<22)
	#define CAN_MCR_MTCR (1<<23)


#endif /* #ifndef _ATSAMA5D3X_H__ */




#if defined(__QNXNTO__) && defined(__USESRCVERSION)
#include <sys/srcversion.h>
__SRCVERSION("$URL: http://svn.ott.qnx.com/product/branches/7.0.0/beta/hardware/startup/lib/public/arm/atsama5d3x.h $ $Rev: 798438 $")
#endif
